Revit 2024 API
DefaultOpenFromCloudCallback Members
The DefaultOpenFromCloudCallback type exposes the following members.
Constructors
Name | Description
DefaultOpenFromCloudCallback
 Create a default open callback. Open latest by default for all scenarios.
Methods
Name | Description
Dispose
Releases all resources used by the DefaultOpenFromCloudCallback
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
OnOpenConflict
 A method called when the conflict is happen during the model opening.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
DefaultOpenFromCloudCallback Class
Autodesk.Revit.DB Namespace